# Procesamiento de Datos con Python
## FES Aragón
### ICO
#### Valeria Carmona Lopez

In [2]:
import pandas as pd
import numpy as np

In [4]:
from datetime import datetime
df = pd.DataFrame({'nombres':('Juan Pérez',
                                 'María Sánchez'
                                 , 'Jorge Vargas',
                                 'Rodrigo Martínez'),
            'fechas':(datetime(1995,12,21), 
                      datetime(1989,1,13), 
                      datetime(1992,9,14), 
                      datetime(1993,7,8)),
            'saldo': (2500, 
                      5345, 
                      np.NaN, 
                      11323.2),
            'al_corriente':(True, 
                            True, 
                            False, 
                            True)})
df

            nombres     fechas    saldo  al_corriente
0        Juan Pérez 1995-12-21   2500.0          True
1     María Sánchez 1989-01-13   5345.0          True
2      Jorge Vargas 1992-09-14      NaN         False
3  Rodrigo Martínez 1993-07-08  11323.2          True

In [17]:
#Operador .iloc
#data.iloc 
print(type(df.iloc[0]))
df.iloc[0] #primer fila

<class 'pandas.core.series.Series'>

nombres                  Juan Pérez
fechas          1995-12-21 00:00:00
saldo                        2500.0
al_corriente                   True
Name: 0, dtype: object

In [32]:
df.iloc[1] #segunda fila

nombres               María Sánchez
fechas          1989-01-13 00:00:00
saldo                        5345.0
al_corriente                   True
Name: 1, dtype: object

In [78]:
df.iloc[-1] #ultimas fechas

nombres            Rodrigo Martínez
fechas          1993-07-08 00:00:00
saldo                       11323.2
al_corriente                   True
Name: 3, dtype: object

In [79]:
df.iloc[:,0] #primer columna

0          Juan Pérez
1       María Sánchez
2        Jorge Vargas
3    Rodrigo Martínez
Name: nombres, dtype: object

In [81]:
df.iloc[:,1] #segunda columna

0   1995-12-21
1   1989-01-13
2   1992-09-14
3   1993-07-08
Name: fechas, dtype: datetime64[ns]

In [83]:
df.iloc[:,-1] #ultima columna

0     True
1     True
2    False
3     True
Name: al_corriente, dtype: bool

In [84]:
df.iloc[1:3] #rango de filas

         nombres     fechas   saldo  al_corriente
1  María Sánchez 1989-01-13  5345.0          True
2   Jorge Vargas 1992-09-14     NaN         False

In [85]:
df.iloc[0:3:2]

        nombres     fechas   saldo  al_corriente
0    Juan Pérez 1995-12-21  2500.0          True
2  Jorge Vargas 1992-09-14     NaN         False

In [86]:
df.iloc[:,1:3] #rango de columnas

      fechas    saldo
0 1995-12-21   2500.0
1 1989-01-13   5345.0
2 1992-09-14      NaN
3 1993-07-08  11323.2

In [18]:
df.iloc[[1,3,0]] #lista de filas

            nombres     fechas    saldo  al_corriente
1     María Sánchez 1989-01-13   5345.0          True
3  Rodrigo Martínez 1993-07-08  11323.2          True
0        Juan Pérez 1995-12-21   2500.0          True

In [19]:
df.iloc[:,[1,3,0]] #lista de columnas

      fechas  al_corriente           nombres
0 1995-12-21          True        Juan Pérez
1 1989-01-13          True     María Sánchez
2 1992-09-14         False      Jorge Vargas
3 1993-07-08          True  Rodrigo Martínez

In [20]:
df.iloc[[1,3,0],[1,3,0]] #lista de filas y columnas

      fechas  al_corriente           nombres
1 1989-01-13          True     María Sánchez
3 1993-07-08          True  Rodrigo Martínez
0 1995-12-21          True        Juan Pérez

In [21]:
df.iloc[1,[1,3,0]]

fechas          1989-01-13 00:00:00
al_corriente                   True
nombres               María Sánchez
Name: 1, dtype: object

In [22]:
df.iloc[1,:] #todas las filas de la primer columna

nombres               María Sánchez
fechas          1989-01-13 00:00:00
saldo                        5345.0
al_corriente                   True
Name: 1, dtype: object

In [23]:
# .loc recupera filas y columnas por etiquetas o una matriz booleana
df.loc[1:3]

            nombres     fechas    saldo  al_corriente
1     María Sánchez 1989-01-13   5345.0          True
2      Jorge Vargas 1992-09-14      NaN         False
3  Rodrigo Martínez 1993-07-08  11323.2          True

In [26]:
df.loc[:,'saldo'] # una columna

0     2500.0
1     5345.0
2        NaN
3    11323.2
Name: saldo, dtype: float64

In [28]:
df.loc[:,'saldo':'al_corriente'] #rango de columnas

     saldo  al_corriente
0   2500.0          True
1   5345.0          True
2      NaN         False
3  11323.2          True

In [29]:
df.loc[:,'saldo':'fechas']

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [30]:
df.loc[:,'fechas':'saldo']

      fechas    saldo
0 1995-12-21   2500.0
1 1989-01-13   5345.0
2 1992-09-14      NaN
3 1993-07-08  11323.2

In [31]:
df.loc[:,['fechas','saldo','nombres']]

      fechas    saldo           nombres
0 1995-12-21   2500.0        Juan Pérez
1 1989-01-13   5345.0     María Sánchez
2 1992-09-14      NaN      Jorge Vargas
3 1993-07-08  11323.2  Rodrigo Martínez

In [33]:
df.loc[1,['fechas','saldo','nombres']]

fechas     1989-01-13 00:00:00
saldo                   5345.0
nombres          María Sánchez
Name: 1, dtype: object

In [34]:
df.loc[1:3,['fechas','saldo','nombres']]

      fechas    saldo           nombres
1 1989-01-13   5345.0     María Sánchez
2 1992-09-14      NaN      Jorge Vargas
3 1993-07-08  11323.2  Rodrigo Martínez

In [36]:
df.loc[[1,3,2],['fechas','saldo','nombres']]

      fechas    saldo           nombres
1 1989-01-13   5345.0     María Sánchez
3 1993-07-08  11323.2  Rodrigo Martínez
2 1992-09-14      NaN      Jorge Vargas

In [38]:
print(df.loc[1:3])
print("-----".center(60,'*'))
print(df.iloc[1:3])

            nombres     fechas    saldo  al_corriente
1     María Sánchez 1989-01-13   5345.0          True
2      Jorge Vargas 1992-09-14      NaN         False
3  Rodrigo Martínez 1993-07-08  11323.2          True
***************************-----****************************
         nombres     fechas   saldo  al_corriente
1  María Sánchez 1989-01-13  5345.0          True
2   Jorge Vargas 1992-09-14     NaN         False

In [46]:
df_iloc =df.iloc[1:3]
df_iloc

         nombres     fechas   saldo  al_corriente
1  María Sánchez 1989-01-13  5345.0          True
2   Jorge Vargas 1992-09-14     NaN         False

In [47]:
print(df_iloc.loc[1])
print("-----".center(60,'*'))
print(df_iloc.iloc[1])

nombres               María Sánchez
fechas          1989-01-13 00:00:00
saldo                        5345.0
al_corriente                   True
Name: 1, dtype: object
***************************-----****************************
nombres                Jorge Vargas
fechas          1992-09-14 00:00:00
saldo                           NaN
al_corriente                  False
Name: 2, dtype: object

In [49]:
df

            nombres     fechas    saldo  al_corriente
0        Juan Pérez 1995-12-21   2500.0          True
1     María Sánchez 1989-01-13   5345.0          True
2      Jorge Vargas 1992-09-14      NaN         False
3  Rodrigo Martínez 1993-07-08  11323.2          True

In [48]:
df['saldo']>3000

0    False
1     True
2    False
3     True
Name: saldo, dtype: bool

In [50]:
df.loc[df['saldo']>3000]

            nombres     fechas    saldo  al_corriente
1     María Sánchez 1989-01-13   5345.0          True
3  Rodrigo Martínez 1993-07-08  11323.2          True

In [51]:
df.loc[df['saldo']>3000,['nombres', 'saldo']]

            nombres    saldo
1     María Sánchez   5345.0
3  Rodrigo Martínez  11323.2

In [52]:
ss3 = df['saldo']>3000
print(type(ss3))
ss3

<class 'pandas.core.series.Series'>

0    False
1     True
2    False
3     True
Name: saldo, dtype: bool

In [53]:
df.loc[ss3]

            nombres     fechas    saldo  al_corriente
1     María Sánchez 1989-01-13   5345.0          True
3  Rodrigo Martínez 1993-07-08  11323.2          True

In [54]:
df.loc[~ss3]

        nombres     fechas   saldo  al_corriente
0    Juan Pérez 1995-12-21  2500.0          True
2  Jorge Vargas 1992-09-14     NaN         False

In [56]:
df['al_corriente']

0     True
1     True
2    False
3     True
Name: al_corriente, dtype: bool

In [55]:
df.loc[df['al_corriente']]

            nombres     fechas    saldo  al_corriente
0        Juan Pérez 1995-12-21   2500.0          True
1     María Sánchez 1989-01-13   5345.0          True
3  Rodrigo Martínez 1993-07-08  11323.2          True

In [59]:
df.loc[df['al_corriente'],'nombres':'saldo']

            nombres     fechas    saldo
0        Juan Pérez 1995-12-21   2500.0
1     María Sánchez 1989-01-13   5345.0
3  Rodrigo Martínez 1993-07-08  11323.2

In [60]:
df

            nombres     fechas    saldo  al_corriente
0        Juan Pérez 1995-12-21   2500.0          True
1     María Sánchez 1989-01-13   5345.0          True
2      Jorge Vargas 1992-09-14      NaN         False
3  Rodrigo Martínez 1993-07-08  11323.2          True

In [61]:
df.isnull() #si tiene valores null

   nombres  fechas  saldo  al_corriente
0    False   False  False         False
1    False   False  False         False
2    False   False   True         False
3    False   False  False         False

In [62]:
df_null= df.isnull()
df_null

   nombres  fechas  saldo  al_corriente
0    False   False  False         False
1    False   False  False         False
2    False   False   True         False
3    False   False  False         False

In [66]:
#Visualizar el numero de datos por columna
print(type(df.isnull().sum()))
df.isnull().sum()

<class 'pandas.core.series.Series'>

nombres         0
fechas          0
saldo           1
al_corriente    0
dtype: int64

In [64]:
df.isnull().sum().sum() #visualizar el numero de faltantes total

1

In [68]:
print(type(df.isnull().values))
df.isnull().values

<class 'numpy.ndarray'>

array([[False, False, False, False],
       [False, False, False, False],
       [False, False,  True, False],
       [False, False, False, False]])

In [69]:
df.isnull().values.any() #Si algun valor es true

True

In [70]:
df.isnull().any()

nombres         False
fechas          False
saldo            True
al_corriente    False
dtype: bool

In [5]:
df[df.isnull().any(1)] #recuperando el true

C:\Users\valer\AppData\Local\Temp\ipykernel_22204\2817068600.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.any and Series.any will be keyword-only.
  df[df.isnull().any(1)] #recuperando el true

        nombres     fechas  saldo  al_corriente
2  Jorge Vargas 1992-09-14    NaN         False